src/cf/DocumentJournals/Деньги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DocumentJournal>
		<Properties>
			<Name>Деньги</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.ПоступлениеНаРасчетныйСчет</xr:Item>
				<xr:Item>Document.СписаниеСРасчетногоСчета</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Доход</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.СуммаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Расход</Name>
					<References>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.СуммаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Валюта</Name>
					<References>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ВалютаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидОперации</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ВидОперации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<References>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ПодразделениеОрганизации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<References>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.РучнаяКорректировка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Организация</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Организация</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>БанковскийСчет</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.СчетОрганизации</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.СчетОрганизации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ДатаВходящегоДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ДатаВходящегоДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.НомерВходящегоДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.НомерВходящегоДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.НазначениеПлатежа</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.НазначениеПлатежа</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/DocumentJournals/Деньги/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Реестр банковских документов'");
	КомандаПечати.Обработчик     = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "БанковскиеВыписки";
	КомандаПечати.Порядок        = 100;
	
	// Печать кассовых ордеров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КассовыйОрдер";
	КомандаПечати.Представление = НСтр("ru = 'Кассовый ордер'");
	КомандаПечати.Обработчик    = "УчетДенежныхСредствКлиент.ВыполнитьКомандуПечатиКассовыйОрдер";
	КомандаПечати.СписокФорм    = "КассовыеДокументы";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Реестр кассовых документов'");
	КомандаПечати.Обработчик     = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "КассовыеДокументы";
	КомандаПечати.Порядок        = 100;
	
КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыДляРеестра(КлючНазначения = "") Экспорт
	
	Результат = Новый Структура;
	
	Если КлючНазначения = "БанковскиеВыписки" Тогда
		
		ПолеЗапросаСумма =
		"	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
		|			ТОГДА Таб.Доход
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.СписаниеСРасчетногоСчета)
		|			ТОГДА Таб.Расход
		|		ИНАЧЕ 0
		|	КОНЕЦ";
		
		ПолеЗапросаИнформация =
		"ВЫБОР
		|		КОГДА Таб.НазначениеПлатежа ПОДОБНО """"
		|			ТОГДА ВЫРАЗИТЬ(Таб.Контрагент.Наименование КАК СТРОКА(100))
		|		ИНАЧЕ """" + (ВЫРАЗИТЬ(Таб.Контрагент.Наименование КАК СТРОКА(100))) + "" / "" + Таб.НазначениеПлатежа
		|	КОНЕЦ";
		
		Результат.Вставить("НомерВходящегоДокумента", "НомерВходящегоДокумента");
		Результат.Вставить("ДатаВходящегоДокумента",  "ДатаВходящегоДокумента");
		
	ИначеЕсли КлючНазначения = "КассовыеДокументы" Тогда
		
		ПолеЗапросаСумма =
		"	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПриходныйКассовыйОрдер)
		|			ТОГДА Таб.Доход
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.РасходныйКассовыйОрдер)
		|			ТОГДА Таб.Расход
		|		ИНАЧЕ 0
		|	КОНЕЦ";
		
		ПолеЗапросаИнформация = "Контрагент";
		
	Иначе
		
		ПолеЗапросаСумма =
		"	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
		|			ТОГДА Таб.Доход
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.СписаниеСРасчетногоСчета)
		|			ТОГДА Таб.Расход
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПриходныйКассовыйОрдер)
		|			ТОГДА Таб.Доход
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.РасходныйКассовыйОрдер)
		|			ТОГДА Таб.Расход
		|		ИНАЧЕ 0
		|	КОНЕЦ";
		
		ПолеЗапросаИнформация =
		"ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПриходныйКассовыйОрдер)
		|			ИЛИ ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.РасходныйКассовыйОрдер)
		|			ТОГДА Таб.Контрагент
		|		КОГДА Таб.НазначениеПлатежа ПОДОБНО """"
		|			ТОГДА ВЫРАЗИТЬ(Таб.Контрагент.Наименование КАК СТРОКА(100))
		|		ИНАЧЕ """" + (ВЫРАЗИТЬ(Таб.Контрагент.Наименование КАК СТРОКА(100))) + "" / "" + Таб.НазначениеПлатежа
		|	КОНЕЦ";
		
		Результат.Вставить("НомерВходящегоДокумента", "НомерВходящегоДокумента");
		Результат.Вставить("ДатаВходящегоДокумента",  "ДатаВходящегоДокумента");
		
	КонецЕсли;
	
	Результат.Вставить("Информация",      ПолеЗапросаИнформация);
	Результат.Вставить("СуммаДокумента",  ПолеЗапросаСумма);
	Результат.Вставить("ВалютаДокумента", "Валюта");
	
	Возврат Результат;
	
КонецФункции

Функция ОтборПоКлючуНазначения(КлючНазначения) Экспорт
	
	ТекстОтбора = "";
	
	Если КлючНазначения = "БанковскиеВыписки" Тогда
		
		ТекстОтбора = "
		|
		|ГДЕ
		|	(Таб.Ссылка ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|			ИЛИ Таб.Ссылка ССЫЛКА Документ.СписаниеСРасчетногоСчета)";
		
	ИначеЕсли КлючНазначения = "КассовыеДокументы" Тогда
		
		ТекстОтбора = "
		|
		|ГДЕ
		|	(Таб.Ссылка ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|			ИЛИ Таб.Ссылка ССЫЛКА Документ.РасходныйКассовыйОрдер)";
		
	КонецЕсли;
	
	Возврат ТекстОтбора;
		
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Не УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Реестр");
	
	// Проверяем, нужно ли для макета ПКО формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Реестр") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм
		ВызватьИсключение "Попытка распечатать реестр в комплекте.";
	КонецЕсли;
	
	// Проверяем, нужно ли для макета ПКО формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПКО") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм
		Документы.ПриходныйКассовыйОрдер.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РКО") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм
		Документы.РасходныйКассовыйОрдер.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
